{"pageProps":{"post":{"attributes":{"description":"Learn how to build a front end website using Astro, React, TypeScript, and Tailwind with step-by-step instructions. Create a multi-stage Dockerfile to build and serve the project with NGINX, simplifying static file serving for your users.","keywords":["Astro","React","TypeScript","Tailwind","Dockerfile","NGINX","static assets"]},"html":"<p>We&#39;re going to do a project now! Feel free to attempt the project first and then follow along with me as I code the answer.</p>\n<p>We&#39;re going to construct a very basic front end website with Astro, React, TypeScript, and Tailwind. Why these? Because I want it to have a lot of dependencies and a big build step. This class isn&#39;t about any of these things but if you want to take a class on React, my <a href=\"https://frontendmasters.com/courses/complete-react-v8/\">intro</a> and <a href=\"https://frontendmasters.com/courses/intermediate-react-v5/\">intermediate</a> classes are available on Frontend Masters.</p>\n<p>You have two choices here: you can either create your own Astro project with <code>npx create-astro@latest</code> or you can just use my copy of it. I added Tailwind and React to mine but you don&#39;t necessarily need to as it doesn&#39;t really affect building the project.</p>\n<p>Also feel free to use your own static asset project or favorite static assets framework. As long as <code>npm run build</code> works and you make sure to get the path right for where the assets are to be served from, it doesn&#39;t matter.</p>\n<p><a href=\"https://github.com/btholt/project-files-for-complete-intro-to-containers-v2/blob/main/static-asset-project\">⛓️ Link to the Project</a></p>\n<blockquote>\n<p>Do note I have the complete Dockerfile in there under <code>solution.Dockerfile</code>. Only glance at it once you&#39;ve tried to build it yourself.</p>\n</blockquote>\n<p>You should have your project ready to go now.</p>\n<p>To make sure this works right now, run <code>npm run dev</code> in your console and make sure the app starts okay. You should see a splash screen. Once you&#39;re ready to build it, run <code>npm run build</code> to have it build for production.</p>\n<p>The project is to make a multi-stage Dockerfile that build the project in one container and then serves it from a different container using NGINX. If you&#39;re not familiar with NGINX, fear not! It is a static file server, which is to say it take takes HTML, CSS, JS, images, fonts, etc. and serves them to your users. It handles all the serving and file headers for you. Using it can be accomplished in few steps. You&#39;ll use the <code>nginx:latest</code> (or <code>nginx:alpine</code>! up to you) container and copy <strong>just the newly built files, not everything</strong> (which is in the <code>dist</code> directory inside of the Astro app) to <code>/usr/share/nginx/html</code> and the <code>nginx</code> will take care of the rest. The <code>nginx</code> container defines <code>CMD</code> in it and if you don&#39;t override it, it starts NGINX for you. Give it a shot! Once you&#39;ve tried, come back here and we&#39;ll do the solution together.</p>\n<blockquote>\n<p>NGINX runs on port 80 by default, so you probably want to route that something like 8080 on your host machine (otherwise you have to run it as root which no one wants to do.) In other words, use <code>-p 8080:80</code> when you start Docker.</p>\n</blockquote>\n<p>Scroll down to see my answer.</p>\n<div style=\"height: 600px\"></div>\n\n<p>Done? If you gave it a shot, your Dockerfile probably shouldn&#39;t very long. Let&#39;s see what I came up with</p>\n<pre><code class=\"hljs language-Dockerfile\"><span class=\"hljs-keyword\">FROM</span> node:<span class=\"hljs-number\">20</span> AS node-builder\n<span class=\"hljs-keyword\">WORKDIR</span><span class=\"language-bash\"> /app</span>\n<span class=\"hljs-keyword\">COPY</span><span class=\"language-bash\"> . .</span>\n<span class=\"hljs-keyword\">RUN</span><span class=\"language-bash\"> npm ci</span>\n<span class=\"hljs-keyword\">RUN</span><span class=\"language-bash\"> npm run build</span>\n\n<span class=\"hljs-comment\"># you could totally use nginx:alpine here too</span>\n<span class=\"hljs-keyword\">FROM</span> nginx:latest\n<span class=\"hljs-keyword\">COPY</span><span class=\"language-bash\"> --from=node-builder /app/dist /usr/share/nginx/html</span>\n</code></pre><p>Now if you run this, it should work:</p>\n<pre><code class=\"hljs language-bash\">docker build -t my-static-app .\ndocker run -it -p 8080:80 --name my-app --<span class=\"hljs-built_in\">rm</span> --init my-static-app\n</code></pre><p>It should be working now! Hooray! Hopefully you&#39;re starting to see the power of what Docker can unlock for you.</p>\n","markdown":"\nWe're going to do a project now! Feel free to attempt the project first and then follow along with me as I code the answer.\n\nWe're going to construct a very basic front end website with Astro, React, TypeScript, and Tailwind. Why these? Because I want it to have a lot of dependencies and a big build step. This class isn't about any of these things but if you want to take a class on React, my [intro][intro] and [intermediate][intermediate] classes are available on Frontend Masters.\n\nYou have two choices here: you can either create your own Astro project with `npx create-astro@latest` or you can just use my copy of it. I added Tailwind and React to mine but you don't necessarily need to as it doesn't really affect building the project.\n\nAlso feel free to use your own static asset project or favorite static assets framework. As long as `npm run build` works and you make sure to get the path right for where the assets are to be served from, it doesn't matter.\n\n[⛓️ Link to the Project][project]\n\n> Do note I have the complete Dockerfile in there under `solution.Dockerfile`. Only glance at it once you've tried to build it yourself.\n\nYou should have your project ready to go now.\n\nTo make sure this works right now, run `npm run dev` in your console and make sure the app starts okay. You should see a splash screen. Once you're ready to build it, run `npm run build` to have it build for production.\n\nThe project is to make a multi-stage Dockerfile that build the project in one container and then serves it from a different container using NGINX. If you're not familiar with NGINX, fear not! It is a static file server, which is to say it take takes HTML, CSS, JS, images, fonts, etc. and serves them to your users. It handles all the serving and file headers for you. Using it can be accomplished in few steps. You'll use the `nginx:latest` (or `nginx:alpine`! up to you) container and copy **just the newly built files, not everything** (which is in the `dist` directory inside of the Astro app) to `/usr/share/nginx/html` and the `nginx` will take care of the rest. The `nginx` container defines `CMD` in it and if you don't override it, it starts NGINX for you. Give it a shot! Once you've tried, come back here and we'll do the solution together.\n\n> NGINX runs on port 80 by default, so you probably want to route that something like 8080 on your host machine (otherwise you have to run it as root which no one wants to do.) In other words, use `-p 8080:80` when you start Docker.\n\nScroll down to see my answer.\n\n<div style=\"height: 600px\"></div>\n\nDone? If you gave it a shot, your Dockerfile probably shouldn't very long. Let's see what I came up with\n\n```Dockerfile\nFROM node:20 AS node-builder\nWORKDIR /app\nCOPY . .\nRUN npm ci\nRUN npm run build\n\n# you could totally use nginx:alpine here too\nFROM nginx:latest\nCOPY --from=node-builder /app/dist /usr/share/nginx/html\n```\n\nNow if you run this, it should work:\n\n```bash\ndocker build -t my-static-app .\ndocker run -it -p 8080:80 --name my-app --rm --init my-static-app\n```\n\nIt should be working now! Hooray! Hopefully you're starting to see the power of what Docker can unlock for you.\n\n[intro]: https://frontendmasters.com/courses/complete-react-v8/\n[intermediate]: https://frontendmasters.com/courses/intermediate-react-v5/\n[project]: https://github.com/btholt/project-files-for-complete-intro-to-containers-v2/blob/main/static-asset-project\n","slug":"static-asset-project","title":"Static Asset Project","section":"Making Tiny Containers","icon":"minimize","filePath":"/home/runner/work/complete-intro-to-containers-v2/complete-intro-to-containers-v2/lessons/05-making-tiny-containers/E-static-asset-project.md","nextSlug":"/lessons/docker-features/bind-mounts","prevSlug":"/lessons/making-tiny-containers/distroless"}},"__N_SSG":true}