{"pageProps":{"post":{"attributes":{"description":"Learn how to build Docker containers with a Dockerfile, the key instructions involved, and the concept of disposable containers. Discover the power of creating container images incrementally by leveraging existing images in the Docker ecosystem.","keywords":["Docker containers","Dockerfile","building containers","disposable containers","docker run command","container versioning"]},"html":"<p>So far we&#39;ve been focusing a lot on running containers and haven&#39;t much dug into building them. This is on purpose because most of benefit of containers for developers comes from the running of containers. If you learn one thing, it should be how to run them. In fact I&#39;ll event venture to say that <em>most</em> developers really only ever need to know how to run them. But you, you&#39;re going to learn how to write them. It&#39;s an extra superpower.</p>\n<p>That said, let&#39;s learn to build our own containers. We&#39;ll again be using Docker for this though there are other ways to do this. Docker has a special file called a <code>Dockerfile</code> which allows you to outline how a container will be built. Each line in a Docker file is a new a directive of how to change your Docker container.</p>\n<p>A <em>big key</em> with Docker container is that they&#39;re supposed to be disposable. You should be able to create them and throw them away as many times as necessary. In other words: adopt a mindset of making everything short-lived. There are other, better tools for long-running, custom containers.</p>\n<p>The (imperfect) analogy that people use sometimes is your containers should be &quot;<a href=\"http://cloudscaling.com/blog/cloud-computing/the-history-of-pets-vs-cattle/\">cattle, not pets</a>&quot;. You design containers so you can easily create and destroy them as much as necessary. The analogy here is that you name your pets and take special care of them whereas you have a thousand cattle and can&#39;t name or take special care of them, just the herd.</p>\n<p>Let&#39;s make the most basic Dockerfile ever. Let&#39;s make a new folder, maybe on your desktop. Put a file in there called <code>Dockerfile</code> (no extension.) In your file, put this.</p>\n<h2>The most basic Dockerfile-based Container</h2>\n<pre><code class=\"hljs language-dockerfile\"><span class=\"hljs-keyword\">FROM</span> node:<span class=\"hljs-number\">20</span>\n\n<span class=\"hljs-keyword\">CMD</span><span class=\"language-bash\"> [<span class=\"hljs-string\">&quot;node&quot;</span>, <span class=\"hljs-string\">&quot;-e&quot;</span>, <span class=\"hljs-string\">&quot;console.log(\\&quot;hi lol\\&quot;)&quot;</span>]</span>\n</code></pre><p><a href=\"https://github.com/btholt/project-files-for-complete-intro-to-containers-v2/blob/main/intro-to-dockerfiles/Dockerfile\">⛓️ Link to the Dockerfile</a></p>\n<p>The first thing on each line (<code>FROM</code> and <code>CMD</code> in this case) are called <em>instructions</em>. They don&#39;t technically have to be all caps but it&#39;s convention to do so so that the file is easier to read. Each one of these instruction incrementally changes the container from the state it was in previously, adding what we call a <em>layer</em>.</p>\n<p>Let&#39;s go ahead and build our container. Run (from inside of the directory of where your Dockerfile is)</p>\n<pre><code class=\"hljs language-bash\">docker build .\n</code></pre><p>You should see it out put a bunch of stuff and it&#39;ll leave you with the hash of an image. After each instruction, you&#39;ll see a hash similar to the ones we&#39;ve been using for the IDs for the containers. You know why that is? It&#39;s because each one of those layers is in-and-of themselves a valid container image! This ends up being important later and we&#39;ll discuss it in a bit.</p>\n<p>Our container has two instructions in its Dockerfile, but actually it has many, many more. How? The first instruction, <code>FROM node:20</code> actually means <em>start</em> with the <code>node</code> container. That container itself <a href=\"https://github.com/nodejs/docker-node/blob/master/Dockerfile-debian.template\">comes from another Dockerfile</a> which build its own container, which itself <a href=\"https://github.com/docker-library/buildpack-deps\">comes from another Dockerfile</a>, which comes ultimately from the <a href=\"https://hub.docker.com/_/debian/\">Debian</a> image.</p>\n<p>This is something very powerful about Docker: you can use images to build other images and build on the work of others. Instead of having to worry about how to install Debian and all the necessary items to build Node.js from its source, we can just start with a well-put-together image from the community.</p>\n<p>Okay, so we start with <code>node:20</code> and then we add the <code>CMD</code> instruction. There will only ever be one of these in effect in a Dockerfile. If you have multiple it&#39;ll just take the last one. This is what you want Docker to do when someone runs the container. In our case, we&#39;re running <code>node -e &quot;console.log(&#39;hi lol&#39;)&quot;</code> from within the container. <code>node -e</code>, if you don&#39;t know, will run whatever is inside of the quotes with Node.js. In this case, we&#39;re logging out <code>hi lol</code> to the console.</p>\n<p>You <em>can</em> put <code>CMD node -e &quot;console.log(&#39;hi lol&#39;)&quot;</code> as that last line and it&#39;ll work but it&#39;s not the preferred way of doing it. This won&#39;t actually go through bash which itself is simpler and usually safer. I do it this way because the docs strongly encourage you to do it this way.</p>\n<p>So, in essence, our containers nabs a <code>node:20</code> container and then when we have it execute a <code>node</code> command when you run it. Let&#39;s try it. Grab the hash from your build and run</p>\n<pre><code class=\"hljs language-bash\">docker run &lt;ID&gt;\n</code></pre><p>It&#39;s a little inconvenient to always have to refer to it by ID, it&#39;d be easier if it had a name. So let&#39;s do that! Try</p>\n<pre><code class=\"hljs language-bash\">docker build . --tag my-node-app <span class=\"hljs-comment\">## or -t instead of --tag</span>\ndocker run my-node-app\n</code></pre><p>Much easier to remember the name rather than a hash. If you want to version it yourself, you can totally do this:</p>\n<pre><code class=\"hljs language-bash\">docker build -t my-node-app:1 .\ndocker run my-node-app:1\n</code></pre><p>Now change your <code>Dockerfile</code> so that it logs out <code>wat</code> instead of <code>hi lol</code>. After you do that.</p>\n<pre><code class=\"hljs language-bash\">docker build -t my-node-app:2 .\ndocker run my-node-app:2\ndocker run my-node-app:1\n</code></pre><p>You can version your containers and hold on to older ones, just in case!</p>\n","markdown":"\nSo far we've been focusing a lot on running containers and haven't much dug into building them. This is on purpose because most of benefit of containers for developers comes from the running of containers. If you learn one thing, it should be how to run them. In fact I'll event venture to say that _most_ developers really only ever need to know how to run them. But you, you're going to learn how to write them. It's an extra superpower.\n\nThat said, let's learn to build our own containers. We'll again be using Docker for this though there are other ways to do this. Docker has a special file called a `Dockerfile` which allows you to outline how a container will be built. Each line in a Docker file is a new a directive of how to change your Docker container.\n\nA _big key_ with Docker container is that they're supposed to be disposable. You should be able to create them and throw them away as many times as necessary. In other words: adopt a mindset of making everything short-lived. There are other, better tools for long-running, custom containers.\n\nThe (imperfect) analogy that people use sometimes is your containers should be \"[cattle, not pets][cattle]\". You design containers so you can easily create and destroy them as much as necessary. The analogy here is that you name your pets and take special care of them whereas you have a thousand cattle and can't name or take special care of them, just the herd.\n\nLet's make the most basic Dockerfile ever. Let's make a new folder, maybe on your desktop. Put a file in there called `Dockerfile` (no extension.) In your file, put this.\n\n## The most basic Dockerfile-based Container\n\n```dockerfile\nFROM node:20\n\nCMD [\"node\", \"-e\", \"console.log(\\\"hi lol\\\")\"]\n```\n\n[⛓️ Link to the Dockerfile][dockerfile]\n\nThe first thing on each line (`FROM` and `CMD` in this case) are called _instructions_. They don't technically have to be all caps but it's convention to do so so that the file is easier to read. Each one of these instruction incrementally changes the container from the state it was in previously, adding what we call a _layer_.\n\nLet's go ahead and build our container. Run (from inside of the directory of where your Dockerfile is)\n\n```bash\ndocker build .\n```\n\nYou should see it out put a bunch of stuff and it'll leave you with the hash of an image. After each instruction, you'll see a hash similar to the ones we've been using for the IDs for the containers. You know why that is? It's because each one of those layers is in-and-of themselves a valid container image! This ends up being important later and we'll discuss it in a bit.\n\nOur container has two instructions in its Dockerfile, but actually it has many, many more. How? The first instruction, `FROM node:20` actually means _start_ with the `node` container. That container itself [comes from another Dockerfile][docker-node] which build its own container, which itself [comes from another Dockerfile][buildpack], which comes ultimately from the [Debian][debian] image.\n\nThis is something very powerful about Docker: you can use images to build other images and build on the work of others. Instead of having to worry about how to install Debian and all the necessary items to build Node.js from its source, we can just start with a well-put-together image from the community.\n\nOkay, so we start with `node:20` and then we add the `CMD` instruction. There will only ever be one of these in effect in a Dockerfile. If you have multiple it'll just take the last one. This is what you want Docker to do when someone runs the container. In our case, we're running `node -e \"console.log('hi lol')\"` from within the container. `node -e`, if you don't know, will run whatever is inside of the quotes with Node.js. In this case, we're logging out `hi lol` to the console.\n\nYou _can_ put `CMD node -e \"console.log('hi lol')\"` as that last line and it'll work but it's not the preferred way of doing it. This won't actually go through bash which itself is simpler and usually safer. I do it this way because the docs strongly encourage you to do it this way.\n\nSo, in essence, our containers nabs a `node:20` container and then when we have it execute a `node` command when you run it. Let's try it. Grab the hash from your build and run\n\n```bash\ndocker run <ID>\n```\n\nIt's a little inconvenient to always have to refer to it by ID, it'd be easier if it had a name. So let's do that! Try\n\n```bash\ndocker build . --tag my-node-app ## or -t instead of --tag\ndocker run my-node-app\n```\n\nMuch easier to remember the name rather than a hash. If you want to version it yourself, you can totally do this:\n\n```bash\ndocker build -t my-node-app:1 .\ndocker run my-node-app:1\n```\n\nNow change your `Dockerfile` so that it logs out `wat` instead of `hi lol`. After you do that.\n\n```bash\ndocker build -t my-node-app:2 .\ndocker run my-node-app:2\ndocker run my-node-app:1\n```\n\nYou can version your containers and hold on to older ones, just in case!\n\n[buildpack]: https://github.com/docker-library/buildpack-deps\n[debian]: https://hub.docker.com/_/debian/\n[docker-node]: https://github.com/nodejs/docker-node/blob/master/Dockerfile-debian.template\n[cattle]: http://cloudscaling.com/blog/cloud-computing/the-history-of-pets-vs-cattle/\n[dockerfile]: https://github.com/btholt/project-files-for-complete-intro-to-containers-v2/blob/main/intro-to-dockerfiles/Dockerfile\n","slug":"intro-to-dockerfiles","title":"Intro to Dockerfiles","section":"Dockerfiles","icon":"file-lines","filePath":"/home/runner/work/complete-intro-to-containers-v2/complete-intro-to-containers-v2/lessons/04-dockerfiles/A-intro-to-dockerfiles.md","nextSlug":"/lessons/dockerfiles/build-a-nodejs-app","prevSlug":"/lessons/docker/docker-cli"}},"__N_SSG":true}