{"pageProps":{"post":{"attributes":{"description":"Explore alternatives to Docker for container building, runtime tools, runtimes, orchestrators, and desktop apps. Learn about tools like Podman, Buildah, containerd, gVisor, OpenShift, Nomad, and more as options in the container ecosystem.","keywords":["Docker alternatives","container tools","container runtimes","orchestration tools","Podman","containerd","Kubernetes alternatives"]},"html":"<p>So far we have only talked about Docker and there&#39;s a pretty good reason for that: for <em>personal</em> use or <em>developer</em> use, Docker is pretty much the indisputable champion. It has all the developer experience bells and whistles, all the mindshare of developers everywhere, and even all the other tools we are about to talk about like to tout their Docker compatability. However it good to keep in mind that Docker is a for-profit company and thus they are trying to align your incentives to there&#39;s and vice versa. It&#39;s good to know what else exists out there.</p>\n<p>I don&#39;t have a lot of experience with any of these as I&#39;ve exclusively used Docker my whole career, but I wanted to get these names out in front of you so you recognize what they are.</p>\n<h2>Container Builders</h2>\n<p>This is what would replace <code>docker build</code>. What tools out there exist for building containers?</p>\n<ul>\n<li><a href=\"https://buildah.io/\">Buildah</a> – Generally can read a Dockerfile without any problems. It also has the neat ability to use hosts&#39; package managers instead of having to include those inside your Docker container. Supported by Red Hat / IBM.</li>\n</ul>\n<h2>Container Runtime Tools</h2>\n<p>This is what would replace <code>docker run</code>. This is the toolset that orchestrates the runtime that actually runs the container.</p>\n<ul>\n<li><a href=\"https://podman.io/\">Podman</a> – Docker relies on having a daemon (background process) in the background to run its containers. Think of it like a client and server. Podman is daemonless: it builds containers to be run directly by the host OS without a daemon in the middle. Podman also has Podman Compose for Docker Compose situations. Supported by Red Hat / IBM.</li>\n<li><a href=\"https://github.com/abiosoft/colima\">Colima</a> – A project to make running container on macOS and Linux easier by cutting down on setup. Still uses Docker&#39;s tools under the hood, just a tool to make interacting with it easier.</li>\n<li><a href=\"https://github.com/rkt/rkt\">rkt</a> – This was a project from CoreOS, who got bought by Red Hat, who got bought by IBM. Along the way rkt got deprecated so this project isn&#39;t maintained. Just wanted to mention it because my last course made mention of it.</li>\n</ul>\n<h2>Container Runtimes</h2>\n<p>This is the actual code executing your container.</p>\n<ul>\n<li><a href=\"https://containerd.io/\">containerd</a> – So Docker actually uses containerd inside of it itself by default, but you can use containerd without Docker and you can use Docker with other Runtimes. containerd is a <a href=\"https://www.cncf.io/\">CNCF</a> project that handles the running of containers, and Docker is a tool that wraps that to add all the Docker stuff on top of it. <a href=\"https://www.docker.com/blog/containerd-vs-docker/\">Docker has a deeper discussion if you want to know more</a>.</li>\n<li><a href=\"https://gvisor.dev/\">gVisor</a> – Google&#39;s container runtime with a particular focus on security. A hot topic at the moment, I see a lot of companies moving stuff to gVisor.</li>\n<li><a href=\"https://katacontainers.io/\">Kata</a> – I know way less about Kata, but they use full-on VMs to separate their &quot;containers&quot; as opposed to just using container features to separate them. From reading their docs, their intent is to be mixed-and-matched with actual containers and only used for containers that need the strongest separation.</li>\n</ul>\n<h2>Container Orchestrators</h2>\n<p>These are alternatives to Kubernetes (and somewhat Docker Compose)</p>\n<ul>\n<li><a href=\"https://mesos.apache.org/\">Apache Mesos</a> – The less I say about Mesos the better as it&#39;s very complicated and it&#39;s a tool I don&#39;t know or use. It&#39;s been around for a long time and therefore has some core believers in it. It predates Kubernetes even. Apache actually tried to stop development on Mesos and people revolted so now they still maintain it.</li>\n<li><a href=\"https://docs.docker.com/engine/swarm/\">Docker Swarm</a> – Before Kubernetes really won out, Docker was push Swarm hard, its own version of Kubernetes. Nowadays unless you&#39;re planning on using Swarm, use Compose and Kubernetes.</li>\n<li><a href=\"https://docs.openshift.com/\">OpenShift</a> – OpenShift is Red Hat&#39;s layer on top of Kubernetes, so indeed it is using Kubernetes underneath the hood. It includes things in it that Kubernetes lacks like CI/CD.</li>\n<li><a href=\"https://www.nomadproject.io/\">Nomad</a> – I&#39;m a big fan of Hashicorp and the products they&#39;ve made. I think they do a great job making DevOps tools approachable by developers and that&#39;s why they&#39;re so popular. Nomad is a tool that takes Kubernetes and strips it down to the most-simple it can be.</li>\n<li><a href=\"https://www.rancher.com/\">Rancher</a> – A project by SUSE (the team who make SUSE Linux) that itself also wraps Kubernetes but with extras stuff in it.</li>\n</ul>\n<h2>Desktop Apps</h2>\n<p>Alternatives to the Docker Desktop app.</p>\n<ul>\n<li><a href=\"https://podman-desktop.io/\">Podman Desktop</a> – Since Red Hat / IBM makes Podman to run containers, they made a desktop app like Docker Desktop to be able to use Podman and Buildah the same way.</li>\n<li><a href=\"https://rancherdesktop.io/\">Rancher Deskopt</a> – Rancher provides a desktop app like Docker Desktop to build and run containers for devs. Users Docker and <a href=\"https://www.rancher.com/\">Rancher</a> and is maintained by SUSE (who make SUSE Linux.)</li>\n</ul>\n","markdown":"So far we have only talked about Docker and there's a pretty good reason for that: for _personal_ use or _developer_ use, Docker is pretty much the indisputable champion. It has all the developer experience bells and whistles, all the mindshare of developers everywhere, and even all the other tools we are about to talk about like to tout their Docker compatability. However it good to keep in mind that Docker is a for-profit company and thus they are trying to align your incentives to there's and vice versa. It's good to know what else exists out there.\n\nI don't have a lot of experience with any of these as I've exclusively used Docker my whole career, but I wanted to get these names out in front of you so you recognize what they are.\n\n## Container Builders\n\nThis is what would replace `docker build`. What tools out there exist for building containers?\n\n- [Buildah][buildah] – Generally can read a Dockerfile without any problems. It also has the neat ability to use hosts' package managers instead of having to include those inside your Docker container. Supported by Red Hat / IBM.\n\n## Container Runtime Tools\n\nThis is what would replace `docker run`. This is the toolset that orchestrates the runtime that actually runs the container.\n\n- [Podman][podman] – Docker relies on having a daemon (background process) in the background to run its containers. Think of it like a client and server. Podman is daemonless: it builds containers to be run directly by the host OS without a daemon in the middle. Podman also has Podman Compose for Docker Compose situations. Supported by Red Hat / IBM.\n- [Colima][colima] – A project to make running container on macOS and Linux easier by cutting down on setup. Still uses Docker's tools under the hood, just a tool to make interacting with it easier.\n- [rkt][rkt] – This was a project from CoreOS, who got bought by Red Hat, who got bought by IBM. Along the way rkt got deprecated so this project isn't maintained. Just wanted to mention it because my last course made mention of it.\n\n## Container Runtimes\n\nThis is the actual code executing your container.\n\n- [containerd][containerd] – So Docker actually uses containerd inside of it itself by default, but you can use containerd without Docker and you can use Docker with other Runtimes. containerd is a [CNCF][cncf] project that handles the running of containers, and Docker is a tool that wraps that to add all the Docker stuff on top of it. [Docker has a deeper discussion if you want to know more][docker-containerd].\n- [gVisor][gvisor] – Google's container runtime with a particular focus on security. A hot topic at the moment, I see a lot of companies moving stuff to gVisor.\n- [Kata][kata] – I know way less about Kata, but they use full-on VMs to separate their \"containers\" as opposed to just using container features to separate them. From reading their docs, their intent is to be mixed-and-matched with actual containers and only used for containers that need the strongest separation.\n\n## Container Orchestrators\n\nThese are alternatives to Kubernetes (and somewhat Docker Compose)\n\n- [Apache Mesos][mesos] – The less I say about Mesos the better as it's very complicated and it's a tool I don't know or use. It's been around for a long time and therefore has some core believers in it. It predates Kubernetes even. Apache actually tried to stop development on Mesos and people revolted so now they still maintain it.\n- [Docker Swarm][swarm] – Before Kubernetes really won out, Docker was push Swarm hard, its own version of Kubernetes. Nowadays unless you're planning on using Swarm, use Compose and Kubernetes.\n- [OpenShift][openshift] – OpenShift is Red Hat's layer on top of Kubernetes, so indeed it is using Kubernetes underneath the hood. It includes things in it that Kubernetes lacks like CI/CD.\n- [Nomad][nomad] – I'm a big fan of Hashicorp and the products they've made. I think they do a great job making DevOps tools approachable by developers and that's why they're so popular. Nomad is a tool that takes Kubernetes and strips it down to the most-simple it can be.\n- [Rancher][rancher] – A project by SUSE (the team who make SUSE Linux) that itself also wraps Kubernetes but with extras stuff in it.\n\n## Desktop Apps\n\nAlternatives to the Docker Desktop app.\n\n- [Podman Desktop][podman-desktop] – Since Red Hat / IBM makes Podman to run containers, they made a desktop app like Docker Desktop to be able to use Podman and Buildah the same way.\n- [Rancher Deskopt][rancher-desktop] – Rancher provides a desktop app like Docker Desktop to build and run containers for devs. Users Docker and [Rancher][rancher] and is maintained by SUSE (who make SUSE Linux.)\n\n[podman]: https://podman.io/\n[buildah]: https://buildah.io/\n[podman-desktop]: https://podman-desktop.io/\n[cncf]: https://www.cncf.io/\n[containerd]: https://containerd.io/\n[docker-containerd]: https://www.docker.com/blog/containerd-vs-docker/\n[rkt]: https://github.com/rkt/rkt\n[kata]: https://katacontainers.io/\n[rancher-desktop]: https://rancherdesktop.io/\n[rancher]: https://www.rancher.com/\n[mesos]: https://mesos.apache.org/\n[openshift]: https://docs.openshift.com/\n[nomad]: https://www.nomadproject.io/\n[gvisor]: https://gvisor.dev/\n[swarm]: https://docs.docker.com/engine/swarm/\n[colima]: https://github.com/abiosoft/colima\n","slug":"docker-alternatives","title":"Docker Alternatives","section":"Wrap Up","icon":"graduation-cap","filePath":"/home/runner/work/complete-intro-to-containers-v2/complete-intro-to-containers-v2/lessons/08-wrap-up/A-docker-alternatives.md","nextSlug":"/lessons/wrap-up/conclusion","prevSlug":"/lessons/multi-container-projects/kompose"}},"__N_SSG":true}