{"pageProps":{"post":{"attributes":{"description":"Learn about containers and Kubernetes, where containers are the building blocks and Kubernetes orchestrates them. Understand fundamental concepts like control planes, nodes, pods, services, and deployments. Explore how to set up Kubernetes using tools like kubectl, minikube, and Docker Desktop for local development.","keywords":["containers","Kubernetes","orchestration","control plane","nodes","pods","services"]},"html":"<p>I like to tell people that containers are the &quot;simple&quot; (simple is a relative term here) part and Kubernetes is the &quot;hard&quot; (hard isn&#39;t relative; Kubernetes is really hard) part. So if this feels hard, it&#39;s because it is.</p>\n<p>NOTE: Because Kubernetes is long, it&#39;s often abbreviates at k8s (k then eight letters then s.)</p>\n<p>So let&#39;s talk about use cases. Containers by themselves are useful for many, many use cases like production apps, machine learning, setting up environments, developer environments, and one-off experimentations. Kubernetes builds on containers (read: you need to know containers to use Kubernetes.) Kubernetes is a container orchestration tool. It allows you to manage large, complicated clusters of containers to multiple different hosts. It&#39;s a complicated tool that solves complicated problems. As such, we are going to do a hello world so you can understand what it is, what it can do, and then leave you to explore more on your own.</p>\n<p>So let&#39;s go over a few fundamental concepts here.</p>\n<ul>\n<li>The <strong>control plane</strong> is a server that coordinates everything else. This is the brain on of your cluster. Some cloud providers actually won&#39;t charge you to run the control plane. You will see this referred to sometimes at the &quot;master node&quot; but it has since been renamed.</li>\n<li><strong>Nodes</strong> (not to be confused with Node.js) are the worker servers that are actually going to be running your containers. One node can one or multiple containers. If you&#39;re running machine learning and you need big, beefy servers to churn through the learning, your node may only run one container. If you&#39;re running a Node.js server like we are, you&#39;ll have many containers on one node.</li>\n<li>Technically, a Node is just a deploy target. It could itself be a VM or a container, or as we said it could be a metal-and-silicon server. It&#39;s not really important. Just think of it as a destination for containers.</li>\n<li>A <strong>pod</strong> is bascially an atom to a cluster: it&#39;s a thing that can&#39;t be divided and thus needs to be deployed together. Imagine if you had several types of containers that all worked together as one unit and wouldn&#39;t work without each other. In this case, you&#39;d put those into a pod. In many cases and what we&#39;re going to do today is do one-container-one-pod. Our app stands alone and thus can be deployed independently. We&#39;ll keep the MongoDB pod and app pod separate because they can scale individually.</li>\n<li>A <strong>service</strong> is a group of pods that make up one backend (services can be other things but bear with me for a second), so to speak. Think one service is a group of microservices. Pods are scaling up and down all the time and thus it&#39;s unreliable to rely on a single pod&#39;s IP. So if I tell the User service to rely on this specific IP for the Admin service, that IP might disappear as that pod is scalled up and down. Enter services. This is a reliable entry point so that these services can talk to each other independent of the relative scale of each other. Like you can have one-container-one-pod, you can have one-pod-one-service as well which means you can have one-container-one-pod-one-service. Services can be more than a backend, they can machine learning nodes, database, caches, etc.</li>\n<li>A <strong>deployment</strong> is where you describe what you want the state of your pods to be and then Kubernetes works to get your cluster into that state.</li>\n</ul>\n<p>Here&#39;s the sad part: doing this in the Windows subsystem for Linux is tough. If you&#39;re following along in Windows, I&#39;d say just grab a coffee and watch how this works. It&#39;s not important that you actually do this. If you&#39;re comfortable in PowerShell, it works well from there or if you can connect to a true Linux VM, it&#39;ll work well from there too. Otherwise, just relax while I do this from macOS.</p>\n<p>So you&#39;re going to need at least one new CLI: <code>kubectl</code>. <code>kubectl</code> (<a href=\"https://kubernetes.io/docs/tasks/tools/install-kubectl/\">see here for how to install</a>) is the tool that allows you to control <em>any</em> Kubernetes cluster, be it local or in the cloud. It&#39;s the single unified CLI for managing Kubernetes. I definitely pronounce this as &quot;cube cuddle&quot; because it makes me happy.</p>\n<p>After that you, you need to make a choice between <code>minikube</code> and using Docker Desktop&#39;s built in Kubernetes support. If it&#39;s all the same to you, I&#39;d suggest using Docker Desktop&#39;s because it&#39;s easier to use.</p>\n<ul>\n<li>Docker Desktop ships with very simple Kubernetes support. It&#39;s nice to learn on but has some limitations. If you need to do more complicated things, get minikube. To enable Kubernetes on Docker Desktop, open the preferences of Docker Desktop, navigate to the Kubernetes tab, enable it, accept when it asks when if it can restart itself, and then wait a few minutes.</li>\n<li><code>minikube</code> (<a href=\"https://kubernetes.io/docs/tasks/tools/install-minikube/\">see here for how to install</a>) is a development tool to get your Kubernetes cluster running on your local computer. You will only ever use this locally.</li>\n</ul>\n<p>You can have both installed, by the way. These will be called <strong>contexts</strong>. To switch between the two, you can <code>kubectl config use-context minikube</code> or <code>kubectl config use-context docker-desktop</code>. You can also shorten <code>use-context</code> to <code>use</code>.</p>\n<p>If you&#39;re using minikube, make sure you run <code>minikube start</code>.</p>\n<p>If you&#39;re using Docker Desktop, you will need to enable Kubernetes.</p>\n<p><img src=\"/images/kubernetes1.png\" alt=\"Gear in the top right\"></p>\n<p>Click the gear in the top right of the Docker Desktop app.</p>\n<p><img src=\"/images/kubernetes2.png\" alt=\"Kubernetes menu, enable Kubernetes\"></p>\n<p>Navigate to the Kubernetes menu and click enable Kubernetes. You will likely have to restart Docker.</p>\n<p>Do a <code>kubectl cluster-info</code> to make sure. You should see your control plane running.</p>\n","markdown":"\nI like to tell people that containers are the \"simple\" (simple is a relative term here) part and Kubernetes is the \"hard\" (hard isn't relative; Kubernetes is really hard) part. So if this feels hard, it's because it is.\n\nNOTE: Because Kubernetes is long, it's often abbreviates at k8s (k then eight letters then s.)\n\nSo let's talk about use cases. Containers by themselves are useful for many, many use cases like production apps, machine learning, setting up environments, developer environments, and one-off experimentations. Kubernetes builds on containers (read: you need to know containers to use Kubernetes.) Kubernetes is a container orchestration tool. It allows you to manage large, complicated clusters of containers to multiple different hosts. It's a complicated tool that solves complicated problems. As such, we are going to do a hello world so you can understand what it is, what it can do, and then leave you to explore more on your own.\n\nSo let's go over a few fundamental concepts here.\n\n- The **control plane** is a server that coordinates everything else. This is the brain on of your cluster. Some cloud providers actually won't charge you to run the control plane. You will see this referred to sometimes at the \"master node\" but it has since been renamed.\n- **Nodes** (not to be confused with Node.js) are the worker servers that are actually going to be running your containers. One node can one or multiple containers. If you're running machine learning and you need big, beefy servers to churn through the learning, your node may only run one container. If you're running a Node.js server like we are, you'll have many containers on one node.\n- Technically, a Node is just a deploy target. It could itself be a VM or a container, or as we said it could be a metal-and-silicon server. It's not really important. Just think of it as a destination for containers.\n- A **pod** is bascially an atom to a cluster: it's a thing that can't be divided and thus needs to be deployed together. Imagine if you had several types of containers that all worked together as one unit and wouldn't work without each other. In this case, you'd put those into a pod. In many cases and what we're going to do today is do one-container-one-pod. Our app stands alone and thus can be deployed independently. We'll keep the MongoDB pod and app pod separate because they can scale individually.\n- A **service** is a group of pods that make up one backend (services can be other things but bear with me for a second), so to speak. Think one service is a group of microservices. Pods are scaling up and down all the time and thus it's unreliable to rely on a single pod's IP. So if I tell the User service to rely on this specific IP for the Admin service, that IP might disappear as that pod is scalled up and down. Enter services. This is a reliable entry point so that these services can talk to each other independent of the relative scale of each other. Like you can have one-container-one-pod, you can have one-pod-one-service as well which means you can have one-container-one-pod-one-service. Services can be more than a backend, they can machine learning nodes, database, caches, etc.\n- A **deployment** is where you describe what you want the state of your pods to be and then Kubernetes works to get your cluster into that state.\n\nHere's the sad part: doing this in the Windows subsystem for Linux is tough. If you're following along in Windows, I'd say just grab a coffee and watch how this works. It's not important that you actually do this. If you're comfortable in PowerShell, it works well from there or if you can connect to a true Linux VM, it'll work well from there too. Otherwise, just relax while I do this from macOS.\n\nSo you're going to need at least one new CLI: `kubectl`. `kubectl` ([see here for how to install][kubectl]) is the tool that allows you to control _any_ Kubernetes cluster, be it local or in the cloud. It's the single unified CLI for managing Kubernetes. I definitely pronounce this as \"cube cuddle\" because it makes me happy.\n\nAfter that you, you need to make a choice between `minikube` and using Docker Desktop's built in Kubernetes support. If it's all the same to you, I'd suggest using Docker Desktop's because it's easier to use.\n\n- Docker Desktop ships with very simple Kubernetes support. It's nice to learn on but has some limitations. If you need to do more complicated things, get minikube. To enable Kubernetes on Docker Desktop, open the preferences of Docker Desktop, navigate to the Kubernetes tab, enable it, accept when it asks when if it can restart itself, and then wait a few minutes.\n- `minikube` ([see here for how to install][minikube]) is a development tool to get your Kubernetes cluster running on your local computer. You will only ever use this locally.\n\nYou can have both installed, by the way. These will be called **contexts**. To switch between the two, you can `kubectl config use-context minikube` or `kubectl config use-context docker-desktop`. You can also shorten `use-context` to `use`.\n\nIf you're using minikube, make sure you run `minikube start`.\n\nIf you're using Docker Desktop, you will need to enable Kubernetes.\n\n![Gear in the top right](/images/kubernetes1.png)\n\nClick the gear in the top right of the Docker Desktop app.\n\n![Kubernetes menu, enable Kubernetes](/images/kubernetes2.png)\n\nNavigate to the Kubernetes menu and click enable Kubernetes. You will likely have to restart Docker.\n\nDo a `kubectl cluster-info` to make sure. You should see your control plane running.\n\n[kubectl]: https://kubernetes.io/docs/tasks/tools/install-kubectl/\n[minikube]: https://kubernetes.io/docs/tasks/tools/install-minikube/\n","slug":"kubernetes","title":"Kubernetes","section":"Multi Container Projects","icon":"boxes-stacked","filePath":"/home/runner/work/complete-intro-to-containers-v2/complete-intro-to-containers-v2/lessons/07-multi-container-projects/B-kubernetes.md","nextSlug":"/lessons/multi-container-projects/kompose","prevSlug":"/lessons/multi-container-projects/docker-compose"}},"__N_SSG":true}